groupmates = [
    {
        "name": "Александр",
        "surname": "Иванов",
        "exams": ["Информатика", "ЭЭиС", "Web"],
        "marks": [4, 3, 5]
    },
    {
        "name": "Иван",
        "surname": "Петров",
        "exams": ["История", "АиГ", "КТП"],
        "marks": [4, 4, 4]
    },
    {
        "name": "Кирилл",
        "surname": "Смирнов",
        "exams": ["Философия", "ИС", "КТП"],
        "marks": [5, 5, 5]
    },
    {
        "name": "Захар",
        "surname": "Белов",
        "exams": ["ВВИТ", "Философия", "АиГ"],
        "marks": [3, 2, 2]
    },
    {
        "name": "Николай",
        "surname": "Портнов",
        "exams": ["ВВИТ", "Философия", "АиГ"],
        "marks": [3, 3, 4]
    },
    {
        "name": "Вова",
        "surname": "Шагинов",
        "exams": ["ВышМат", "Физра", "Англ"],
        "marks": [5, 5, 5]
    }
]
